Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # ibm_container_bind_service.bind_service[0] will be created
+ resource "ibm_container_bind_service" "bind_service" {
      + cluster_name_id       = (known after apply)
      + id                    = (known after apply)
      + namespace_id          = "default"
      + role                  = "Writer"
      + secret_name           = (sensitive value)
      + service_instance_id   = (known after apply)
      + service_instance_name = (known after apply)
    }

  # ibm_container_vpc_cluster.cluster[0] will be created
+ resource "ibm_container_vpc_cluster" "cluster" {
      + albs                            = (known after apply)
      + crn                             = (known after apply)
      + disable_public_service_endpoint = false
      + flavor                          = "bx2.4x16"
      + force_delete_storage            = false
      + id                              = (known after apply)
      + ingress_hostname                = (known after apply)
      + ingress_secret                  = (sensitive value)
      + kube_version                    = "1.19.4"
      + master_status                   = (known after apply)
      + master_url                      = (known after apply)
      + name                            = "cluster-vpc-0"
      + pod_subnet                      = (known after apply)
      + private_service_endpoint_url    = (known after apply)
      + public_service_endpoint_url     = (known after apply)
      + resource_controller_url         = (known after apply)
      + resource_crn                    = (known after apply)
      + resource_group_id               = "5eb57fd577b64b51beb832c2e9d5287a"
      + resource_group_name             = (known after apply)
      + resource_name                   = (known after apply)
      + resource_status                 = (known after apply)
      + service_subnet                  = (known after apply)
      + state                           = (known after apply)
      + tags                            = [
          + "cluster-vpc",
          + "terraform",
        ]
      + update_all_workers              = false
      + vpc_id                          = (known after apply)
      + wait_for_worker_update          = true
      + wait_till                       = "OneWorkerNodeReady"
      + worker_count                    = 3
      + worker_labels                   = (known after apply)

      + kms_config {
          + crk_id           = (known after apply)
          + instance_id      = (known after apply)
          + private_endpoint = false
        }

      + zones {
          + name      = "us-south-1"
          + subnet_id = (known after apply)
        }
    }

  # ibm_is_security_group.sg1 will be created
+ resource "ibm_is_security_group" "sg1" {
      + id                      = (known after apply)
      + name                    = "asgharlabs-sg1"
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group          = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_name           = (known after apply)
      + rules                   = (known after apply)
      + vpc                     = (known after apply)
    }

  # ibm_is_security_group_rule.egress_all_all will be created
+ resource "ibm_is_security_group_rule" "egress_all_all" {
      + direction   = "outbound"
      + group       = (known after apply)
      + id          = (known after apply)
      + ip_version  = "ipv4"
      + related_crn = (known after apply)
      + remote      = "0.0.0.0/0"
      + rule_id     = (known after apply)
    }

  # ibm_is_security_group_rule.outbound_26_traffic_118_rule will be created
+ resource "ibm_is_security_group_rule" "outbound_26_traffic_118_rule" {
      + direction   = "outbound"
      + group       = (known after apply)
      + id          = (known after apply)
      + ip_version  = "ipv4"
      + related_crn = (known after apply)
      + remote      = "161.26.0.0/16"
      + rule_id     = (known after apply)
    }

  # ibm_is_security_group_rule.outbound_8_traffic_118_rule will be created
+ resource "ibm_is_security_group_rule" "outbound_8_traffic_118_rule" {
      + direction   = "outbound"
      + group       = (known after apply)
      + id          = (known after apply)
      + ip_version  = "ipv4"
      + related_crn = (known after apply)
      + remote      = "166.8.0.0/14"
      + rule_id     = (known after apply)
    }

  # ibm_is_security_group_rule.ping_ingress_traffic_118_rule will be created
+ resource "ibm_is_security_group_rule" "ping_ingress_traffic_118_rule" {
      + direction   = "inbound"
      + group       = (known after apply)
      + id          = (known after apply)
      + ip_version  = "ipv4"
      + related_crn = (known after apply)
      + remote      = "0.0.0.0/0"
      + rule_id     = (known after apply)

      + icmp {
          + type = 8
        }
    }

  # ibm_is_security_group_rule.tcp_ingress_traffic_118_rule will be created
+ resource "ibm_is_security_group_rule" "tcp_ingress_traffic_118_rule" {
      + direction   = "inbound"
      + group       = (known after apply)
      + id          = (known after apply)
      + ip_version  = "ipv4"
      + related_crn = (known after apply)
      + remote      = "0.0.0.0/0"
      + rule_id     = (known after apply)

      + tcp {
          + port_max = 32767
          + port_min = 30000
        }
    }

  # ibm_is_security_group_rule.udp_ingress_traffic_118_rule will be created
+ resource "ibm_is_security_group_rule" "udp_ingress_traffic_118_rule" {
      + direction   = "inbound"
      + group       = (known after apply)
      + id          = (known after apply)
      + ip_version  = "ipv4"
      + related_crn = (known after apply)
      + remote      = "0.0.0.0/0"
      + rule_id     = (known after apply)

      + udp {
          + port_max = 32767
          + port_min = 30000
        }
    }

  # ibm_is_subnet.subnet1 will be created
+ resource "ibm_is_subnet" "subnet1" {
      + available_ipv4_address_count = (known after apply)
      + id                           = (known after apply)
      + ipv4_cidr_block              = (known after apply)
      + ipv6_cidr_block              = (known after apply)
      + name                         = "asgharlabs-subnet1"
      + network_acl                  = (known after apply)
      + resource_controller_url      = (known after apply)
      + resource_crn                 = (known after apply)
      + resource_group               = (known after apply)
      + resource_group_name          = (known after apply)
      + resource_name                = (known after apply)
      + resource_status              = (known after apply)
      + status                       = (known after apply)
      + total_ipv4_address_count     = 256
      + vpc                          = (known after apply)
      + zone                         = "us-south-1"
    }

  # ibm_is_vpc.vpc will be created
+ resource "ibm_is_vpc" "vpc" {
      + address_prefix_management = "auto"
      + classic_access            = false
      + crn                       = (known after apply)
      + cse_source_addresses      = (known after apply)
      + default_network_acl       = (known after apply)
      + default_security_group    = (known after apply)
      + id                        = (known after apply)
      + name                      = (known after apply)
      + resource_controller_url   = (known after apply)
      + resource_crn              = (known after apply)
      + resource_group            = (known after apply)
      + resource_group_name       = (known after apply)
      + resource_name             = (known after apply)
      + resource_status           = (known after apply)
      + security_group            = (known after apply)
      + status                    = (known after apply)
      + subnets                   = (known after apply)
      + tags                      = (known after apply)
    }

  # ibm_kms_key.test will be created
+ resource "ibm_kms_key" "test" {
      + crn                     = (known after apply)
      + endpoint_type           = "public"
      + force_delete            = true
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + key_id                  = (known after apply)
      + key_name                = "test_root_key"
      + payload                 = (known after apply)
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_name           = (known after apply)
      + resource_status         = (known after apply)
      + standard_key            = false
      + type                    = (known after apply)
    }

  # ibm_resource_instance.cos_instance[0] will be created
+ resource "ibm_resource_instance" "cos_instance" {
      + crn                     = (known after apply)
      + dashboard_url           = (known after apply)
      + extensions              = (known after apply)
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + location                = "global"
      + name                    = "my-service-instance-0"
      + plan                    = "standard"
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_name           = (known after apply)
      + resource_status         = (known after apply)
      + service                 = "cloud-object-storage"
      + service_endpoints       = (known after apply)
      + status                  = (known after apply)
      + tags                    = (known after apply)
    }

  # ibm_resource_instance.kms_instance1 will be created
+ resource "ibm_resource_instance" "kms_instance1" {
      + crn                     = (known after apply)
      + dashboard_url           = (known after apply)
      + extensions              = (known after apply)
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + location                = "us-south"
      + name                    = "test_kms"
      + plan                    = "tiered-pricing"
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group_name     = (known after apply)
      + resource_name           = (known after apply)
      + resource_status         = (known after apply)
      + service                 = "kms"
      + service_endpoints       = (known after apply)
      + status                  = (known after apply)
      + tags                    = (known after apply)
    }

  # random_id.random will be created
+ resource "random_id" "random" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 15 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.asgharlabs.io/lock?id=jjasghar%252Fibmcloud-terraform-atlantis%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
